app/views/users/profile.html.erb

SELECT "educations".* FROM "educations" WHERE "educations"."user_id" = 2
SELECT "employers".* FROM "employers" WHERE "employers"."user_id" = 2
---

  window.Timeline = Timeline = (function() {

    function Timeline(data) {
      var box, kudo, kudos, _i, _j, _len, _len2, _ref, _ref2,
        _this = this;
      console.log(data);
      _ref = data.employers;
      for (_i = 0, _len = _ref.length; _i < _len; _i++) {
        kudo = _ref[_i];
        kudo.type = 'work';
      }
      _ref2 = data.education;
      for (_j = 0, _len2 = _ref2.length; _j < _len2; _j++) {
        kudo = _ref2[_j];
        kudo.type = 'education';
      }
      kudos = data.employers.concat(data.education);
      box = $('<div class="box padfront"></div>');
      this.wrap = $('<div id="timeline"></div>');
      this.boxHash = kudos.map(function(kudo) {
        return _this.decorateBoxNode(box.clone(), kudo);