app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
---
  def profile
    puts params[:id].blank?

    @user = User.find params[:id]